### DataFrame

In [1]:
import pandas as pd
import numpy as np

In [34]:
# Create lists of lists, grades and number one column
location_list = ['Austin','Austin','San Antonio','Laredo','Dallas','El Paso','Chicago','Naperville','Springfield','Miami','Orlando','Austin','Austin','San Antonio','Laredo','Dallas','El Paso','Chicago','Naperville','Springfield','Miami','Orlando','Austin','Austin','San Antonio','Laredo','Dallas','El Paso','Chicago','Naperville','Springfield','Miami','Orlando']
state_list = ['TX','TX','TX','TX','TX','TX','IL','IL','IL','FL','FL','TX','TX','TX','TX','TX','TX','IL','IL','IL','FL','FL','TX','TX','TX','TX','TX','TX','IL','IL','IL','FL','FL']
name_list = ['Juan','Ellie','George','Maria','Test','Gina','Andrew','Joe','Mary','Tabelon','Wuda','Juan','Ellie','George','Maria','Test','Gina','Andrew','Joe','Mary','Tabelon','Wuda','Juan','Ellie','George','Maria','Test','Gina','Andrew','Joe','Mary','Tabelon','Wuda']
lastname_list = ['Martinez','Smith','Garcia','Logit','Account','Perdue','Lablanc','Dile','Smith','Legruti','Jenkins','Martinez','Smith','Garcia','Logit','Account','Perdue','Lablanc','Dile','Smith','Legruti','Jenkins','Martinez','Smith','Garcia','Logit','Account','Perdue','Lablanc','Dile','Smith','Legruti','Jenkins']
challenge_grades = [100,None,100,100,55,75,81,77,32,100,30,99.0,95.0,np.nan,100.0,60.0,86.0,83.0,45.0,75.0,95.0,0.0,70.0,100.0,88,100.0,90.0,65,55.0,81.0,99.0,81.0,75.0]
challenge_number = [1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,2,2,3,3,3,3,3,3,3,3,3,3,3]

# Create dictionary of lists
class_data = { 'location': location_list,
               'state': state_list,
               'name': name_list,
               'lastname': lastname_list,
               'challenge_grades': challenge_grades,
               'challenge_number': challenge_number}

In [52]:
# create df
df = pd.DataFrame(data=class_data)
df.head()

      location state    name  lastname  challenge_grades  challenge_number
0       Austin    TX    Juan  Martinez             100.0                 1
1       Austin    TX   Ellie     Smith               NaN                 1
2  San Antonio    TX  George    Garcia             100.0                 1
3       Laredo    TX   Maria     Logit             100.0                 1
4       Dallas    TX    Test   Account              55.0                 1

### Checking for empty cells

In [36]:
# Check for nulls
df['challenge_grades'].isnull()[0:10]

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: challenge_grades, dtype: bool

In [37]:
# Check for nan
df['challenge_grades'].isna()[0:10]

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: challenge_grades, dtype: bool

### Convert NaN to -99

In [53]:
df.fillna(-99, inplace=True)

In [54]:
df.head()

      location state    name  lastname  challenge_grades  challenge_number
0       Austin    TX    Juan  Martinez             100.0                 1
1       Austin    TX   Ellie     Smith             -99.0                 1
2  San Antonio    TX  George    Garcia             100.0                 1
3       Laredo    TX   Maria     Logit             100.0                 1
4       Dallas    TX    Test   Account              55.0                 1

### Locate all -1s and assign new value

In [40]:
# filter_query = df['challenge_grades']==-99
# filter_query[0:10]

In [58]:
# Show records with -99, use filter
df.loc[df['challenge_grades']==-99]

       location state    name lastname  challenge_grades  challenge_number
1        Austin    TX   Ellie    Smith             -99.0                 1
13  San Antonio    TX  George   Garcia             -99.0                 2

In [56]:
# Show records with -99, use loc
df.loc[[1,13]]

       location state    name lastname  challenge_grades  challenge_number
1        Austin    TX   Ellie    Smith             -99.0                 1
13  San Antonio    TX  George   Garcia             -99.0                 2

## updating records with loc

In [59]:
# Filter 
filter_query = df['challenge_grades']==-99
# set all records that meet the filter criteria to zero
df.loc[filter_query,"challenge_grades"] = 0
# display 
df.loc[[1,13]]

       location state    name lastname  challenge_grades  challenge_number
1        Austin    TX   Ellie    Smith               0.0                 1
13  San Antonio    TX  George   Garcia               0.0                 2

## Calculate mean

In [ ]:
df['challenge_grades'].mean()